akiramiyakoda.cppincludeguard
avetis.tokyo-night
cs128.cs128-clang-tidy
eamodio.gitlens
eliverlara.andromeda
espressif.esp-idf-extension
fill-labs.dependi
github.copilot-chat
github.vscode-github-actions
grapecity.gc-excelviewer
hediet.vscode-drawio
llvm-vs-code-extensions.lldb-dap
llvm-vs-code-extensions.vscode-clangd
miguelsolorio.symbols
ms-azuretools.vscode-containers
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode-remote.remote-containers
openai.chatgpt
panicbit.cargo
rust-lang.rust-analyzer
simonho.kanagawa-paper
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
usernamehw.errorlens
vadimcn.vscode-lldb
vscode-icons-team.vscode-icons
vscodevim.vim
xaver.clang-format
zainchen.json
jdinhlife.gruvbox
